{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"lambda_43_input:0": {"name": "lambda_43_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "lambda_43_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/lambda_43/Reshape/shape", "op": "Const", "input": ["^lambda_43_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^lambda_43_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^lambda_43_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^lambda_43_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/flatten_43/Const", "op": "Const", "input": ["^lambda_43_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^lambda_43_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^lambda_43_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/lambda_43/Reshape", "op": "Reshape", "input": ["lambda_43_input", "StatefulPartitionedCall/sequential_43/lambda_43/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/conv2d_87/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_43/lambda_43/Reshape", "Func/StatefulPartitionedCall/input/_2"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_43/max_pooling2d_87/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_43/conv2d_87/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_43/conv2d_87/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_43/max_pooling2d_87/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/conv2d_88/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_43/conv2d_87/Relu", "Func/StatefulPartitionedCall/input/_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_43/max_pooling2d_88/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_43/conv2d_88/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/conv2d_88/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_43/max_pooling2d_88/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/conv2d_89/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_43/conv2d_88/Relu", "Func/StatefulPartitionedCall/input/_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_43/max_pooling2d_89/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_43/conv2d_89/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_43/conv2d_89/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_43/max_pooling2d_89/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/flatten_43/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_43/conv2d_89/Relu", "StatefulPartitionedCall/sequential_43/flatten_43/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_43/dense_86/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_43/flatten_43/Reshape", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_43/dense_86/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_43/dense_86/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_43/dense_87/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_43/dense_86/Relu", "Func/StatefulPartitionedCall/input/_10"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_43/dense_87/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_43/dense_87/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_43/dense_87/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_43/lambda_43/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_43/flatten_43/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [64, 256], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [256, 10], "dtype": "float32"}]}]}