{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"flatten_8_input:0": {"name": "flatten_8_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "flatten_8_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}}, {"name": "StatefulPartitionedCall/sequential_10/flatten_8/Const", "op": "Const", "input": ["^flatten_8_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^flatten_8_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^flatten_8_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^flatten_8_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^flatten_8_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "16"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^flatten_8_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_10/flatten_8/Reshape", "op": "Reshape", "input": ["flatten_8_input", "StatefulPartitionedCall/sequential_10/flatten_8/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_21/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_10/flatten_8/Reshape", "Func/StatefulPartitionedCall/input/_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_21/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/dense_21/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_22/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_21/Relu", "Func/StatefulPartitionedCall/input/_4"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_22/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/dense_22/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_23/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_22/Relu", "Func/StatefulPartitionedCall/input/_6"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_23/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/dense_23/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_24/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_23/Relu", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_24/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_10/dense_24/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_25/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_10/dense_24/Relu", "Func/StatefulPartitionedCall/input/_10"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10/dense_25/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_10/dense_25/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_10/dense_25/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_10/flatten_8/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [784, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [16, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [16, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [16, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [16, 10], "dtype": "float32"}]}]}