{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"lambda_42_input:0": {"name": "lambda_42_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "lambda_42_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}}, {"name": "StatefulPartitionedCall/sequential_42/lambda_42/Reshape/shape", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/flatten_42/Const", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^lambda_42_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/lambda_42/Reshape", "op": "Reshape", "input": ["lambda_42_input", "StatefulPartitionedCall/sequential_42/lambda_42/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_42/conv2d_84/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_42/lambda_42/Reshape", "Func/StatefulPartitionedCall/input/_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_42/max_pooling2d_84/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_42/conv2d_84/Conv2D"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/conv2d_84/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_42/max_pooling2d_84/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/conv2d_85/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_42/conv2d_84/Relu", "Func/StatefulPartitionedCall/input/_4"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_42/max_pooling2d_85/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_42/conv2d_85/Conv2D"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_42/conv2d_85/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_42/max_pooling2d_85/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/conv2d_86/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_42/conv2d_85/Relu", "Func/StatefulPartitionedCall/input/_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_42/max_pooling2d_86/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_42/conv2d_86/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_42/conv2d_86/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_42/max_pooling2d_86/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/flatten_42/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_42/conv2d_86/Relu", "StatefulPartitionedCall/sequential_42/flatten_42/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_42/dense_84/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_42/flatten_42/Reshape", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/dense_84/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_42/dense_84/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_42/dense_85/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_42/dense_84/Relu", "Func/StatefulPartitionedCall/input/_10"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_42/dense_85/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_42/dense_85/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_42/dense_85/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_42/lambda_42/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_42/flatten_42/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [64, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [128, 10], "dtype": "float32"}]}]}