{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"lambda_54_input:0": {"name": "lambda_54_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "lambda_54_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/lambda_54/Reshape/shape", "op": "Const", "input": ["^lambda_54_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^lambda_54_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^lambda_54_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^lambda_54_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_54/flatten_54/Const", "op": "Const", "input": ["^lambda_54_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^lambda_54_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "input": ["^lambda_54_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/lambda_54/Reshape", "op": "Reshape", "input": ["lambda_54_input", "StatefulPartitionedCall/sequential_54/lambda_54/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_54/conv2d_108/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_54/lambda_54/Reshape", "Func/StatefulPartitionedCall/input/_2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_54/max_pooling2d_108/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_54/conv2d_108/Conv2D"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_54/conv2d_108/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_54/max_pooling2d_108/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/conv2d_109/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_54/conv2d_108/Relu", "Func/StatefulPartitionedCall/input/_4"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_54/max_pooling2d_109/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_54/conv2d_109/Conv2D"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/conv2d_109/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_54/max_pooling2d_109/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/conv2d_110/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_54/conv2d_109/Relu", "Func/StatefulPartitionedCall/input/_6"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_54/max_pooling2d_110/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_54/conv2d_110/Conv2D"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_54/conv2d_110/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_54/max_pooling2d_110/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/flatten_54/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_54/conv2d_110/Relu", "StatefulPartitionedCall/sequential_54/flatten_54/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_54/dense_108/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_54/flatten_54/Reshape", "Func/StatefulPartitionedCall/input/_8"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/dense_108/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_54/dense_108/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_54/dense_109/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_54/dense_108/Relu", "Func/StatefulPartitionedCall/input/_10"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_54/dense_109/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_54/dense_109/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_54/dense_109/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_54/lambda_54/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_54/flatten_54/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [256, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_10", "shape": [128, 10], "dtype": "float32"}]}]}