{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"conv2d_28_input:0": {"name": "conv2d_28_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "conv2d_28_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_32", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_33", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_38", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_39", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/flatten_4/Const", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_44", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_45", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv2d_28_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_28/Relu", "op": "_FusedConv2D", "input": ["conv2d_28_input", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_28/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_29/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_8", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_29/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_30/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_14", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_30/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_31/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_31/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_32/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_26", "Func/StatefulPartitionedCall/input/_27"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_32/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_33/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_32", "Func/StatefulPartitionedCall/input/_33"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_33/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/conv2d_34/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_38", "Func/StatefulPartitionedCall/input/_39"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/sequential_4/conv2d_34/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/flatten_4/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3", "StatefulPartitionedCall/sequential_4/flatten_4/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/flatten_4/Reshape", "Func/StatefulPartitionedCall/input/_44", "Func/StatefulPartitionedCall/input/_45"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_4/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_4/dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4/dense_4/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [5, 5, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_29/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_26", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_27", "shape": [64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_32", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_33", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_38", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_39", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/flatten_4/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_44", "shape": [128, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_28/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_45", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Scaled", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_34/FusedBatchNormV3/Offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_33/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_32/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_31/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/batch_normalization_30/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}]}]}