{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"inputs": {"lambda_39_input:0": {"name": "lambda_39_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "lambda_39_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}}, {"name": "StatefulPartitionedCall/sequential_39/lambda_39/Reshape/shape", "op": "Const", "input": ["^lambda_39_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^lambda_39_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_39/flatten_39/Const", "op": "Const", "input": ["^lambda_39_input"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "input": ["^lambda_39_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2704"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "input": ["^lambda_39_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_39/lambda_39/Reshape", "op": "Reshape", "input": ["lambda_39_input", "StatefulPartitionedCall/sequential_39/lambda_39/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_39/conv2d_79/Conv2D", "op": "Conv2D", "input": ["StatefulPartitionedCall/sequential_39/lambda_39/Reshape", "Func/StatefulPartitionedCall/input/_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_39/max_pooling2d_79/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_39/conv2d_79/Conv2D"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_39/conv2d_79/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_39/max_pooling2d_79/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_39/flatten_39/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_39/conv2d_79/Relu", "StatefulPartitionedCall/sequential_39/flatten_39/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_39/dense_78/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_39/flatten_39/Reshape", "Func/StatefulPartitionedCall/input/_4"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_39/dense_78/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_39/dense_78/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_39/dense_79/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_39/dense_78/Relu", "Func/StatefulPartitionedCall/input/_6"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_39/dense_79/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_39/dense_79/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_39/dense_79/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_39/lambda_39/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_39/flatten_39/Const", "shape": [2], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [2704, 128], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_6", "shape": [128, 10], "dtype": "float32"}]}]}